Repository: jameshilliard/actiontec_opensrc_mi424wr-rev-i_fw-40-21-18
Catalog: rg/pkg/kaffe/po/*.po
Languages: de, fr, zh_cn, zh_tw

source: Error: out of memory.
de: Fehler: Nicht genügend Speicher.
fr: Erreur: pas assez de mémoire.
zh_cn: 错误：内存不足
zh_tw: 錯誤：記憶體不足

source: Error: No stack size found for -ss option.
de: Fehler: Keine Stack Angabe für -ss Option gefunden.
fr: Erreur: La taille de la pile n'a pas été trouvé après l'argument -ss.
zh_cn: 错误：在 -ss 选项中沒有指定堆叠空间
zh_tw: 錯誤：在 -ss 選項中沒有指定堆疊空間

source: Warning: Attempt to set stack size smaller than %d - ignored.
de: Warnung: Versuch die Größe des Stacks kleiner als %d zu setzen ignoriert.
fr: Avertissement: Vous ne pouvez pas spécifer une taille de pile plus petite que %d - valeur ignorée.
zh_cn: 警告：尝试设定少于 %d 的堆叠空间 - 忽略
zh_tw: 警告：嘗試設定少於 %d 的堆疊空間 - 忽略

source: Error: No heap size found for -mx option.
de: Fehler: Keine Heap-Größenangabe für -mx Option gefunden.
fr: Erreur: Pas de taille de tas trouvée après l'argument -mx.
zh_cn: 错误：在 -mx 选项中沒有指定 heap 空间
zh_tw: 錯誤：在 -mx 選項中沒有指定 heap 空間

source: Error: No heap size found for -ms option.
de: Fehler: Keine Heap-Größenangabe für -ms Option gefunden.
fr: Erreur: Pas de taille du tas trouvée après l'argument -ms.
zh_cn: 错误：在 -ms 选项中沒有指定 heap 空间
zh_tw: 錯誤：在 -ms 選項中沒有指定 heap 空間

source: Error: No heap size found for -as option.
de: Fehler: Keine Heap-Größenangabe für -as Option gefunden.
fr: Erreur: Pas de taille de tas trouvée après l'argument -as.
zh_cn: 错误：在 -as 选项中沒有指定 heap 空间
zh_tw: 錯誤：在 -as 選項中沒有指定 heap 空間

source: Error: -Xxprof_syms option requires a file name.
de: Fehler: -Xxprof_syms Option benötigt einen Dateinamen.
fr: Erreur: L'argument -Xxprof_syms nécessite un nom de fichier.
zh_cn: 错误：-Xxprof_syms 选项需要提供文件名
zh_tw: 錯誤：-Xxprof_syms 選項需要提供檔名

source: Unable to create profiler symbol file %s.
de: Kann die Profiler Symboldatei %s nicht erstellen.
fr: Impossible de créer le fichier %s devant contenir les symboles de profilage.
zh_cn: 无法建立 profiler 符号资讯文件：%s
zh_tw: 無法建立 profiler 符號資訊檔：%s

source: Error: -Xxprof_gmon option requires a file name.
de: Fehler: -Xxprof_gmon Option benötigt einen Dateinamen.
fr: Erreur: L'argument -Xxprof_gmon nécessite un nom de fichier.
zh_cn: 错误：-Xxprof_gmon 选项需要提供文件名
zh_tw: 錯誤：-Xxprof_gmon 選項需要提供檔名

source: Unable to create gmon file %s.
de: Kann die gmon Datei %s nicht erstellen.
fr: Impossible de créer le fichier gmon nommé %s.
zh_cn: 无法建立 gmon 文件： %s
zh_tw: 無法建立 gmon 檔： %s

source: Error: -Xxdebug_file option requires a file name.
de: Fehler: -Xxdebug_file Option benötigt einen Dateinamen.
fr: Erreur: L'option -Xxdebug_file requiert un nom de fichier.
zh_cn: 错误：-Xxdebug_file 选项需要提供文件名
zh_tw: 錯誤：-Xxdebug_file 選項需要提供檔名

source: Error: -Xfeedback option requires a file name.
de: Fehler: -Xfeedback Option benötigt einen Dateinamen.
fr: Erreur: L'option -Xfeedback requiert un nom de fichier.
zh_cn: 错误：-Xfeedback 选项需要提供文件名
zh_tw: 錯誤：-Xfeedback 選項需要提供檔名

source: Error: -vmstats option requires a second arg.
de: Fehler: -vmstats Option benötigt ein zweites Argument.
fr: Erreur: L'option -vmstats requiert un second argument.\n
zh_cn: 错误：-vmstats 选项需要额外的参数
zh_tw: 錯誤：-vmstats 選項需要額外的參數

source: Error: -vmdebug option requires a debug flag. Use `list' for a list.
de: Fehler: -vmdebug Option benötigt ein Debug-Flag. Verwende `list' für eine Liste.
fr: Erreur: L'option -vmdebug requiert un paramètre. Utilisez 'list' pour avoir une liste des paramètres.
zh_cn: 错误：-vmdebug 选项需要侦错旗标，请用 -vmdebug list 取得旗标列表
zh_tw: 錯誤：-vmdebug 選項需要偵錯旗標，請用 -vmdebug list 取得旗標列表

source: Error: -debug-fd an open descriptor.
de: Fehler: -debug-fd ist ein offener Deskriptor.
fr: Erreur: -debug-fd requiert un descripteur de fichier ouvert.
zh_cn: 错误： -debug-fd 后面应该有个 file descriptor
zh_tw: 錯誤： -debug-fd 後面應該有個 file descriptor

source: Error: -debug-fd requires an integer.
de: Fehler: -debug-fd benötigt eine Ganzzahl.
fr: Erreur: -debug-fd requiert un entier.
zh_cn: 错误：-debug-fd 需要给定一个整数。
zh_tw: 錯誤：-debug-fd 需要給定一個整數。

source: Error: Unrecognized JVM specific option `%s'.
de: Fehler: Unbekannte JVM spezifische Option %s'.
fr: Erreur: L'option '%s' spécifique à la JVM n'est pas connue.
zh_cn: 错误：无法辨认的 JVM 选项： '%s'
zh_tw: 錯誤：無法辨識的 JVM 選項： '%s'

source: Unknown flag: %s
de: Unbekanntes Flag: %s
fr: Paramètre inconnu: %s
zh_cn: 未知的旗标：%s
zh_tw: 未知的旗標：%s

source: usage: kaffe [-options] class Options are: -help Print this message -version Print version number -fullversion Print verbose version info
de: Verwendung: kaffe [-Optionen] Klasse Optionen sind: -help Ausgabe dieser Meldung -version Ausgabe der Versionsnummer -fullversion Ausgabe ausführlicher Versionsinformationen
fr: Usage: kaffe [-options] classe Les options sont: -help Affiche ce message -version Affiche le numéro de version -fullversion Affiche plus d'information sur la version
zh_cn: 使用方式： kaffe [-选项] 类別 选项： -help 印列本讯息 -version 印列版本号码 -fullversion 印列详细的版本资讯
zh_tw: 使用方式： kaffe [-選項] 類別 選項： -help 印列本訊息 -version 印列版本號碼 -fullversion 印列詳細的版本資訊

source: -ia32 Execute the ia32 version of Kaffe
de: -ia32 Ausführung der ia32 Version von Kaffe
fr: -ia32 Exécute la version ia32 de kaffe
zh_cn: -ia32 执行 ia32 版本的 Kaffe
zh_tw: -ia32 執行 ia32 版本的 Kaffe

source: -ss <size> Maximum native stack size -mx <size> Maximum heap size -ms <size> Initial heap size -as <size> Heap increment -classpath <path> Set classpath -Xbootclasspath:<path> Set bootclasspath -Xbootclasspath/a:<path> Append path to bootclasspath -Xbootclasspath/p:<path> Prepend path to bootclasspath -D<property>=<value> Set a property -verify * Verify all bytecode -verifyremote * Verify bytecode loaded from network -noverify Do not verify any bytecode -noclassgc Disable class garbage collection -verbosegc Print message during garbage collection -v, -verbose Be verbose -verbosejit Print message during JIT code generation -verbosemem Print detailed memory allocation statistics -verbosecall Print detailed call flow information -nodeadlock Disable deadlock detection
de: -ss <Größe> Maximale native Stack Größe -mx <Größe> Maximale Heap Größe -ms <Größe> Initiale Heap Größe -as <Größe> Heap Inkrement -classpath <Pfad> Setzen des classpath -Xbootclasspath:<Pfad> Setzen des bootclasspath -Xbootclasspath/a:<Pfad> Füge Pfad zum bootclasspath hinzu -Xbootclasspath/p:<Pfad> Füge Pfad vor den bootclasspath hinzu -D<Eigenschaft>=<Wert> Eine Eigenschaft setzen -verify * Verifiziere gesamten Bytecode -verifyremote * Verifiziere vom Netzwerk geladenen Bytecode -noverify Verifiziere keinerlei Bytecode -noclassgc Abschalten der Speicherbereinigung -verbosegc Ausgabe von Meldungen während Speicherbereinigung -v, -verbose Sei ausführlich -verbosejit Ausgabe von Meldungen während JIT Code Generierung -verbosemem Ausgabe detaillierter Statistik der Speicherbelegung -verbosecall Ausgabe detaillierter Informationen zum Aufrufverlauf -nodeadlock Abschalten der Deadlock Erkennung
fr: -ss <taille> Taille maximum de la pile native -mx <taille> Taille maximum du tas -ms <taille> Taille initiale du tas -as <taille> Valeur de l'incrément pour le tas -classpath <chemin> Spécifie le chemin d'accès aux classes -Xbootclasspath:<chemin> Spécifie le bootclasspath -Xbootclasspath/a:<chemin> Ajoute le chemin à la suite du bootclasspath -Xbootclasspath/p:<chemin> Ajoute le chemin en tête du bootclasspath -D<propriété>=<valeur> Specifie une propriété -verify * Vérifie tout le bytecode -verifyremote * Vérifie le bytecode chargé depuis un réseau -noverify N'effectue aucune vérification du bytecode -noclassgc Désactive le nettoyeur de mémoire -verbosegc Affiche un message pendant le nettoyage -v, -verbose Affiche plus de messages -verbosejit Affiche un message pendant la génération de code JIT -verbosemem Affiche des statistiques sur la mémoire utilisée -verbosecall Affiche des information sur les méthodes appelées -nodeadlock Désactive la détection des deadlock
zh_cn: -ss <size> 指定最大的原生 (native) 堆叠空间 -mx <size> 指定最大 heap 空间 -ms <size> 指定初始 heap 空间 -as <size> 指定 heap 递增空间 -classpath <path> 设定 classpath -Xbootclasspath:<path> 设定 bootclasspath -Xbootclasspath/a:<path> 在 bootclasspath 之后追加 path -Xbootclasspath/p:<path> 在 bootclasspath 前增加 path -D<property>=<value> 给予特定属性 -verify * 检验 (verify) 所有 bytecode -verifyremote * 检验 (verify) 从网络下载的 bytecode -noverify 不检验 (verify) 任何 bytecode -noclassgc 关闭 class garbage collection -verbosegc 在执行 garbage collection 时印列详细资讯 -v, -verbose 印列详细的执行情況 -verbosejit 在 JIT code generation 时印列详细资讯 -verbosemem 印列详细内存配置统计 -verbosecall 印列详细呼叫流程资讯 -nodeadlock 关闭死结 (deadlock) 侦测
zh_tw: -ss <size> 指定最大的原生 (native) 堆疊空間 -mx <size> 指定最大 heap 空間 -ms <size> 指定初始 heap 空間 -as <size> 指定 heap 遞增空間 -classpath <path> 設定 classpath -Xbootclasspath:<path> 設定 bootclasspath -Xbootclasspath/a:<path> 在 bootclasspath 之後追加 path -Xbootclasspath/p:<path> 在 bootclasspath 前增加 path -D<property>=<value> 給予特定屬性 -verify * 檢驗 (verify) 所有 bytecode -verifyremote * 檢驗 (verify) 從網路下載的 bytecode -noverify 不檢驗 (verify) 任何 bytecode -noclassgc 關閉 class garbage collection -verbosegc 在執行 garbage collection 時印列詳細資訊 -v, -verbose 印列詳細的執行情況 -verbosejit 在 JIT code generation 時印列詳細資訊 -verbosemem 印列詳細記憶體配置統計 -verbosecall 印列詳細呼叫流程資訊 -nodeadlock 關閉死結 (deadlock) 偵測

source: -prof Enable profiling of Java methods
de: -prof Aktiviere Profiling von Java Methoden
fr: -prof Active le profilage des méthodes Java
zh_cn: -prof 开启 Java method 的 profiling
zh_tw: -prof 開啟 Java method 的 profiling

source: -Xxprof Enable cross language profiling -Xxprof_syms <file> Name of the profiling symbols file [Default: kaffe-jit-symbols.s] -Xxprof_gmon <file> Base name for gmon files [Default: xgmon.out]
de: -Xxprof Aktiviere Profiling über Sprachgrenzen hinweg -Xxprof_syms <file> Name der Profiling symbols Datei [Standard: kaffe-jit-symbols.s] -Xxprof_gmon <file> Basisname für gmon Dateien [Standard: xgmon.out]
fr: -Xxprof Active le profilage inter-langage -Xxprof_syms <fichier> Fichier contenant les symboles de profilages [Défaut: kaffe-jit-symbols.s] -Xxprof_gmon <fichier> Nom de base pour les fichiers gmon [Défaut: xgmon.out]
zh_cn: -Xxprof 开启跨语言 profiling -Xxprof_syms <文件名> 指定 profiling symbol 的文件名 [预设值：kaffe-jit-symbols.s] -Xxprof_gmon <文件名> 指定 gmon 文件名 [预设值：xgmon.out]
zh_tw: -Xxprof 開啟跨語言 profiling -Xxprof_syms <檔名> 指定 profiling symbol 的檔案名稱 [預設值：kaffe-jit-symbols.s] -Xxprof_gmon <檔名> 指定 gmon 檔案的名稱 [預設值：xgmon.out]

source: -Xxdebug_file <file> Name of the debugging symbols file
de: -Xxdebug_file <Datei> Name der Debug symbols Datei
fr: -Xxdebug_file <fichier> Fichier pour les symboles de débogages.
zh_cn: -Xxdebug_file <文件名> 指定 debugging symbol 文件名
zh_tw: -Xxdebug_file <檔名> 指定 debugging symbol 檔案名稱

source: -Xfeedback <file> The file name to write feedback data to
de: -Xfeedback <Datei> Dateiname zum Schreiben der Rückmeldungsdaten
fr: -Xfeedback <fichier> Le fichier devant contenir les données feedback
zh_cn: -Xfeedback <文件名> 指定输出 feedback 资料的文件名
zh_tw: -Xfeedback <檔名> 指定輸出 feedback 資料的檔名

source: -debug * Trace method calls -noasyncgc * Do not garbage collect asynchronously -cs, -checksource * Check source against class files -oss <size> * Maximum java stack size -jar Executable is a JAR
de: -debug * Methodenaufrufe verfolgen -noasyncgc * Keine asynchrone Speicherbereinigung -cs, -checksource * Source gegen die class Dateien überprüfen -oss <Größe> * Maximale Java Stack-Größe -jar Ausführbare Datei ist eine JAR Datei
fr: -debug * Trace les appels de méthodes -noasyncgc * Ne pas nettoyer en arrière-plan -cs, -checksource * Vérifie le code source -oss <taille> * Taille maximale de la pile -jar L'exécutable est un JAR
zh_cn: -debug * 追踪 method 呼叫情况 -noasyncgc * 不施行非同步 garbage collection -cs, -checksource * 检验 class 文件的來源 -oss <空间> * 指定最大 Java 堆叠空间 -jar 执行 JAR
zh_tw: -debug * 追蹤 method 呼叫情況 -noasyncgc * 不施行非同步 garbage collection -cs, -checksource * 檢驗 class 檔的來源 -oss <空間> * 指定最大 Java 堆疊空間 -jar 執行 JAR

source: -vmdebug <flag{,flag}> Internal VM debugging. Set flag=list for a list
de: -vmdebug <Flag{,Flag}> Internes Debuggen der VM. Setze Flag=list für eine Liste
fr: -vmdebug <flag{,flag}> Débogage interne de la VM. Utilisez flag=list pour avoir la liste
zh_cn: -vmdebug <旗标{,旗标}> 内部 VM 侦錯，設定 flag=list 可取得侦错项目清单
zh_tw: -vmdebug <旗標{,旗標}> 內部 VM 偵錯，設定 flag=list 可取得偵錯項目清單

source: -debug-fd <descriptor> Descriptor to send debug info to
de: -debug-fd <Deskriptor> Deskriptor an den die Debug Informationen gesendet werden
zh_cn: -debug-fd <descriptor> 所要传送侦错讯息的 descriptor
zh_tw: -debug-fd <descriptor> 所要傳送偵錯訊息的 descriptor

source: -vmstats <flag{,flag}> Print VM statistics. Set flag=all for all
de: -vmstats <Flag{,Flag}> Ausgabe von VM Statistiken. Setze Flag=all für alle
fr: -vmstats <flag{,flag> Affiche des statistiques sur la VM. Utilisez flag=all pour les avoir toutes.
zh_cn: -vmstats <旗标{,旗标}> 印列 VM 统计数据，特定 flag=all 可取得全部項目
zh_tw: -vmstats <旗標{,旗標}> 印列 VM 統計數據，特定 flag=all 可取得全部項目

source: -Xnative-big-math Use GMP for faster, native bignum calculations
de: -Xnative-big-math Nutze GMP für schnellere, native bignum Berechnungen
fr: -Xnative-big-math Utiliser GMP pour des calculs BigNum natifs et plus raides.
zh_cn: -Xnative-big-math 使用 GMP 作为原生的大数运算，以获取更快的执行速度
zh_tw: -Xnative-big-math 使用 GMP 作為原生的大數運算，以獲取更快的執行速度

source: -Xkaffe-xlib-awt Use Kaffe's Xlib AWT backend
de: -Xkaffe-xlib-awt Benutze Kaffe's Xlib AWT Implementierung
fr: -Xkaffe-xlib-awt Utiliser le système graphique Xlib AWT de Kaffe.
zh_cn: -Xkaffe-xlib-awt 使用 Kaffe 的 Xlib AWT backend
zh_tw: -Xkaffe-xlib-awt 使用 Kaffe 的 Xlib AWT backend

source: -Xkaffe-qt-awt Use Kaffe's Qt2/3/Embedded AWT backend
de: -Xkaffe-qt-awt Benutze Kaffe's Qt2/3/Embedded AWT Implementierung
fr: -Xkaffe-qt-awt Utiliser le système graphique Qt2/3/E AWT de Kaffe.
zh_cn: -Xkaffe-qt-awt 使用 Kaffe 的 Qt2/3/Embedded AWT backend
zh_tw: -Xkaffe-qt-awt 使用 Kaffe 的 Qt2/3/Embedded AWT backend

source: -Xkaffe-nanox-awt Use Kaffe's Nano-X AWT backend
de: -Xkaffe-nanox-awt Benutze Kaffe's Nano-X AWT Implementierung
fr: -Xkaffe-nanoxlib-awt Utiliser le système graphique Nano-X AWT de Kaffe.
zh_cn: -Xkaffe-xlib-awt 使用 Kaffe 的 Nano-X AWT backend
zh_tw: -Xkaffe-xlib-awt 使用 Kaffe 的 Nano-X AWT backend

source: * Option currently ignored. Compatibility options: -Xss <size> Maximum native stack size -Xmx <size> Maximum heap size -Xms <size> Initial heap size -cp <path> Set classpath
de: * Zurzeit ignorierte Optionen. Kompatibilitätsoptionen: -Xss <Größe> Maximale native Stack-Größe -Xmx <Größe> Maximale Heap-Größe -Xms <Größe> Initiale Heap-Größe -cp <Pfad> Setzt den classpath
fr: * Options pour le moment ignorées. Options de compatibilitité: -Xss <taille> Taille maximum de la pile native -Xmx <taille> Taille maximum du tas -Xms <taille> Taille initiale du tas -cp <chemin> Spécifie le classpath
zh_cn: 标示 * 的项目目前是忽略的 保持相容性的选项有： -Xss <空间> 指定最大原生 (native) 堆叠空間 -Xmx <空间> 指定最大 heap 空间 -Xms <空间> 指定初始 heap 空间 -cp <路径> 设定 classpath
zh_tw: 標示 * 的項目目前是忽略的 保持相容性的選項有： -Xss <空間> 指定最大原生 (native) 堆疊空間 -Xmx <空間> 指定最大 heap 空間 -Xms <空間> 指定初始 heap 空間 -cp <路徑> 設定 classpath

source: Copyright (c) 1996-2005 Kaffe.org project contributors (please see the source code for a full list of contributors). All rights reserved. Portions Copyright (c) 1996-2002 Transvirtual Technologies, Inc. The Kaffe virtual machine is free software, licensed under the terms of the GNU General Public License. Kaffe.org is a an independent, free software community project, not directly affiliated with Transvirtual Technologies, Inc. Kaffe is a Trademark of Transvirtual Technologies, Inc. Kaffe comes with ABSOLUTELY NO WARRANTY.
de: Copyright (c) 1996-2005 Kaffe.org Projekt Mitwirkende (Der Source code enthält eine vollständige Liste der Mitwirkenden). All rights reserved. Portions Copyright (c) 1996-2002 Transvirtual Technologies, Inc. Die Kaffe virtual machine ist freie Software, lizenziert unter den Bedingungen der GNU General Public License. Kaffe.org ist ein unabhängiges, freies Software Gemeinschaftsprojekt, nicht direkt verbunden mit Transvirtual Technologies, Inc. Kaffe ist ein Markenname von Transvirtual Technologies, Inc. Kaffe kommt mit ABSOLUT KEINER GARANTIE.

source: Stack default size: %d KB
de: Stack Standardgröße: %d KB
fr: Taille par défault de la pile: %d KB
zh_tw: 預設堆疊空間： %d Kb

source: Engine: %s Version: %s Java Version: %s
fr: Moteur: %s Version: %s Version Java: %s
zh_tw: 執行引擎： %s 版本： %s Java版本： %s
